/************************************************************************/
/* 
leetcode-10 ：
正则表达式匹配，
给定一个字符串s和字符规律p，请实现一个支持识别'.'和'*'的正则表达式匹配
'.'匹配任意单个字符
'*'匹配 零个或多个前面的哪一个元素
所谓匹配，是要涵盖整个s字符串，而不是部分s字符串。

说明:
s可能为空，且只包含a-z的小写字母
s可能为空，且只包含a-z的小写字母，以及字符','和'*'



示例:
输入
s = "aa";
p = "a";
输出:
false
理由：p无法匹配s整个字符串

s = "aa";
p ="a*";
输出:
true
理由：因为'*'可以匹配零个或多个前面字符。


相关标签：
字符串、动态规划、回溯算法


*/
/************************************************************************/
#include "Problems-UnionDef.h"
class Solution {
public:
	bool isMatch(string s, string p) {

	}
};
int main()
{
	Solution regx;
	string 
	while(get())
	return 0;
}